#Задание 1
Just_list = [56, 'cloud', 2, 345, 'Город' ]
for n in Just_list:
    print(n, type(n))

input("Нажмите enter, чтобы выйти")