#Задание 3
n = int(input("Введите число:"))

Numb = n*10 + n
Numb2= n*100 + Numb
Numb3 = n + Numb + Numb2
print(n,"+",Numb, "+", Numb2,"=", Numb3)

input("Нажмите enter, чтобы выйти")
