#Задание 1.
age = 32

Number = 200
amount = 50
print(age)
print(Number)
print(amount)
name = input(str("Введите ваше имя и фамилию: "))
print(name)

random_Number = input("Введите любое целое число или несколько чисел через запятую: ")

print(random_Number)
input("Нажмите enther, чтобы выйти.")# Используется для того, чтобы программа не закрывалась сразу, если запустить через терминал