#Задание 4
print(f"числа в пределах от 20 до 240, кратные 21 или 20:{[el for el in range(20, 241) if el%20==0 or el % 21==0]}")

input("нажмите enter, чтобы выйти")