#Задание 6
def int_funk(a):
    print(a.title())
        
user = input("введите слова через пробел-")

int_funk(user)
input("Нажмите enter, чтобы выйти")